CSI API ETABS v1
cDetailing.GetDetailedWall_OneWallStack_OnePier_OneDesignLegOutputInfo Method
 Represents Rebars in one Design Leg, on one story as defined in ETABS
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetDetailedWall_OneWallStack_OnePier_OneDesignLegOutputInfo(
	int WallStackIndex,
	int PierIndex,
	int DesignLegIndex,
	ref string GUID,
	ref string PierLabel,
	ref double x1,
	ref double y1,
	ref double z1,
	ref double x2,
	ref double y2,
	ref double z2,
	ref double ZLevel,
	ref int NumberVerticalBars,
	ref int NumberHorizontalBars,
	ref int TotalAreaObjects,
	ref string[] AreaObjectNames
)
Function GetDetailedWall_OneWallStack_OnePier_OneDesignLegOutputInfo (
	WallStackIndex As Integer,
	PierIndex As Integer,
	DesignLegIndex As Integer,
	ByRef GUID As String,
	ByRef PierLabel As String,
	ByRef x1 As Double,
	ByRef y1 As Double,
	ByRef z1 As Double,
	ByRef x2 As Double,
	ByRef y2 As Double,
	ByRef z2 As Double,
	ByRef ZLevel As Double,
	ByRef NumberVerticalBars As Integer,
	ByRef NumberHorizontalBars As Integer,
	ByRef TotalAreaObjects As Integer,
	ByRef AreaObjectNames As String()
) As Integer
Dim instance As cDetailing
Dim WallStackIndex As Integer
Dim PierIndex As Integer
Dim DesignLegIndex As Integer
Dim GUID As String
Dim PierLabel As String
Dim x1 As Double
Dim y1 As Double
Dim z1 As Double
Dim x2 As Double
Dim y2 As Double
Dim z2 As Double
Dim ZLevel As Double
Dim NumberVerticalBars As Integer
Dim NumberHorizontalBars As Integer
Dim TotalAreaObjects As Integer
Dim AreaObjectNames As String()
Dim returnValue As Integer
returnValue = instance.GetDetailedWall_OneWallStack_OnePier_OneDesignLegOutputInfo(WallStackIndex,
	PierIndex, DesignLegIndex, GUID,
	PierLabel, x1, y1, z1, x2, y2, z2, ZLevel,
	NumberVerticalBars, NumberHorizontalBars,
	TotalAreaObjects, AreaObjectNames)
int GetDetailedWall_OneWallStack_OnePier_OneDesignLegOutputInfo(
	int WallStackIndex,
	int PierIndex,
	int DesignLegIndex,
	String^% GUID,
	String^% PierLabel,
	double% x1,
	double% y1,
	double% z1,
	double% x2,
	double% y2,
	double% z2,
	double% ZLevel,
	int% NumberVerticalBars,
	int% NumberHorizontalBars,
	int% TotalAreaObjects,
	array<String^>^% AreaObjectNames
)
abstract GetDetailedWall_OneWallStack_OnePier_OneDesignLegOutputInfo :
        WallStackIndex : int *
        PierIndex : int *
        DesignLegIndex : int *
        GUID : string byref *
        PierLabel : string byref *
        x1 : float byref *
        y1 : float byref *
        z1 : float byref *
        x2 : float byref *
        y2 : float byref *
        z2 : float byref *
        ZLevel : float byref *
        NumberVerticalBars : int byref *
        NumberHorizontalBars : int byref *
        TotalAreaObjects : int byref *
        AreaObjectNames : string[] byref -> int
Parameters
WallStackIndex
Type: System.Int32
 Wall Stack Index
PierIndex
Type: System.Int32
 Pier Output Index
DesignLegIndex
Type: System.Int32
 Design leg Index
GUID
Type: System.String
 GUID
PierLabel
Type: System.String
 Label of the Piersetion in ETABS from which the Design Leg is taken
x1
Type: System.Double
 Global Centerline of the Design Leg. Matching with ETABS Design leg data X1
y1
Type: System.Double
 Global Centerline of the Design Leg. Matching with ETABS Design leg data Y1
z1
Type: System.Double
 Global Centerline of the Design Leg. Matching with ETABS Design leg data Z1
x2
Type: System.Double
 Global Centerline of the Design Leg. Matching with ETABS Design leg data X2
y2
Type: System.Double
 Global Centerline of the Design Leg. Matching with ETABS Design leg data Y2
z2
Type: System.Double
 Global Centerline of the Design Leg. Matching with ETABS Design leg data Z2
ZLevel
Type: System.Double
 The reference Z level of Design Leg, in global coordinates
NumberVerticalBars
Type: System.Int32
 Number of Vertical Bars in Local Coordinates of Desig Leg
NumberHorizontalBars
Type: System.Int32
 Number of Horizontal Bars, in local coordinates of Design Leg
TotalAreaObjects
Type: System.Int32
 Total number of ETABS Area Objects
AreaObjectNames
Type: System.String[]
 ETABS Area Object Name
Return Value
Type: Int32
Returns zero if the function is successful; otherwise it returns a nonzero value.
See Also
Reference
cDetailing Interface
ETABSv1 Namespace